Repository: vladstanescu94/Diameris
Catalog: Diameris/Resources/Localizable.xcstrings
Source language: en
Languages: ro

source: Account Name
ro: Nume cont

source: Account Type
ro: Tip cont

source: Accounts
ro: Conturi

source: Balance
ro: Sold

source: Boost Multiplier
ro: Multiplicator boost

source: Coming soon
ro: În curând

source: Currency
ro: Monedă

source: Current Balance
ro: Sold curent

source: Dashboard
ro: Panou

source: Destination
ro: Destinație

source: Edit Account
ro: Editare cont

source: Effective Rate
ro: Rată efectivă

source: Emergency
ro: Urgență

source: Emergency Fund Target
ro: Țintă fond de urgență

source: Expenses
ro: Cheltuieli

source: income
ro: venit

source: Insights
ro: Analize

source: Joint
ro: Comun

source: monthly income
ro: venit lunar

source: Name
ro: Nume

source: New Month
ro: Lună nouă

source: Other
ro: Altele

source: Personal Account
ro: Cont personal

source: Primary
ro: Principal

source: Primary Account
ro: Cont principal

source: Primary Savings
ro: Economii principale

source: Primary Savings Account
ro: Cont principal de economii

source: Profile
ro: Profil

source: Remaining Money
ro: Bani rămași

source: Save
ro: Salvează

source: Savings
ro: Economii

source: Savings are calculated from income after expenses.
ro: Economiile se calculează din venitul rămas după cheltuieli.

source: Savings Boost
ro: Boost economii

source: Savings Rate
ro: Rată economii

source: Settings
ro: Setări

source: Tap an account to edit its settings.
ro: Atinge un cont pentru a-i edita setările.

source: Target
ro: Țintă

source: Target Amount
ro: Sumă țintă

source: The primary savings account receives automatic savings allocation.
ro: Contul principal de economii primește alocarea automată a economiilor.

source: Type
ro: Tip

source: Where leftover money goes after savings allocation.
ro: Unde merg banii rămași după alocarea economiilor.

source: Your name
ro: Numele tău
